import {
  createStyles,
  Container,
  Text,
  Button,
  Group,
  keyframes,
  Badge,
  Flex,
} from "@mantine/core";
import { GithubIcon } from "@mantine/ds";
import { BrandTwitch, Scale } from "tabler-icons-react";
import { atom, useRecoilState } from "recoil";
import { recoil_isLogined } from "../states";
import Image from "next/image";
import { apiAddress } from "../constValues";

const BREAKPOINT = "@media (max-width: 755px)";

const goLogin = () => {
  // use authorization code grant flow
  const clientId = "9n3ebjaenen1jipslsk11ufrcfo51t";
  // api.clippy.kr
  const redirectUri = `${apiAddress}/user/login`;
  const url = `https://id.twitch.tv/oauth2/authorize?client_id=${clientId}&redirect_uri=${redirectUri}&response_type=code&scope=clips:edit+user:read:follows`;

  window.location.href = url;
};

const goLogout = () => {
  const url = `${apiAddress}/user/logout`;
  window.location.href = url;
};

export const scale = keyframes({
  "from, to": { transform: "scale(0.7)" },
});

const useStyles = createStyles((theme) => ({
  wrapper: {
    position: "relative",
    boxSizing: "border-box",
    backgroundColor:
      theme.colorScheme === "dark" ? theme.colors.dark[8] : theme.white,
  },

  inner: {
    position: "relative",
    paddingTop: 200,
    paddingBottom: 120,
    paddingLeft: 30,
    paddingRight: 30,

    [BREAKPOINT]: {
      paddingBottom: 80,
      paddingTop: 80,
    },
  },

  title: {
    fontSize: 62,
    fontWeight: 900,
    lineHeight: 1.1,
    margin: 0,
    padding: 0,
    color: theme.colorScheme === "dark" ? theme.white : theme.black,

    [BREAKPOINT]: {
      fontSize: 32,
      lineHeight: 1.2,
    },
  },

  description: {
    marginTop: theme.spacing.xl,
    fontSize: 24,
    textAlign: "center",

    [BREAKPOINT]: {
      fontSize: 18,
    },
  },

  controls: {
    // animation: `${scale} 3s ease-in-out`,
    marginTop: theme.spacing.xl * 2,

    [BREAKPOINT]: {
      marginTop: theme.spacing.xl,
    },
  },

  control: {
    height: 54,
    paddingLeft: 38,
    paddingRight: 38,
    marginTop: 40,

    [BREAKPOINT]: {
      height: 54,
      paddingLeft: 18,
      paddingRight: 18,
      flex: 1,
    },
  },
}));

const FooterMain = () => {
  return (
    <div className="px-[30px] pb-[50px] mb-[20px] w-[100vw]">
      <Text align="right">© CLIPPY 2022. MADE IN SEOUL</Text>
    </div>
  );
};

export function IndexBeforeLogin() {
  const { classes } = useStyles();

  const [isLogined, setIsLogined] = useRecoilState(recoil_isLogined);

  return (
    <Flex direction={"column"} align="center" justify="center">
      <Container mb={200} size={700} className={classes.inner}>
        <h1 className={classes.title}>
          {" "}
          <Group>
            <Image alt="logo" src="/images/clip.svg" width={35} height={56} />
            <span
              className="bg-gradient-to-r text-transparent bg-clip-text from-indigo-500 via-purple-500 to-indigo-500 animate-text text-6xl mt-[-10px]"
              // variant="gradient"
              // gradient={{ from: "violet", to: "grape" }}
            >
              CLIPPY
            </span>
            <svg
              height="25"
              viewBox="0 0 37 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <rect width="37" height="20" rx="4" fill="#75D91F" />
              <path
                d="M8.79883 10.7002H6.24219L6.22852 9.20996H8.34082C8.71452 9.20996 9.01758 9.16439 9.25 9.07324C9.48698 8.9821 9.66016 8.84993 9.76953 8.67676C9.87891 8.49902 9.93359 8.28027 9.93359 8.02051C9.93359 7.72428 9.87891 7.48503 9.76953 7.30273C9.66016 7.12044 9.48698 6.98828 9.25 6.90625C9.01758 6.81966 8.7168 6.77637 8.34766 6.77637H7.04883V15H4.82031V5.04688H8.34766C8.94466 5.04688 9.47786 5.10156 9.94727 5.21094C10.4167 5.32031 10.8154 5.48893 11.1436 5.7168C11.4762 5.94466 11.7292 6.22949 11.9023 6.57129C12.0755 6.91309 12.1621 7.31641 12.1621 7.78125C12.1621 8.18685 12.071 8.5651 11.8887 8.91602C11.7109 9.26693 11.4238 9.55176 11.0273 9.77051C10.6309 9.98926 10.0999 10.1077 9.43457 10.126L8.79883 10.7002ZM8.70996 15H5.6748L6.48145 13.2773H8.70996C9.05176 13.2773 9.32975 13.2227 9.54395 13.1133C9.75814 13.0039 9.91536 12.8558 10.0156 12.6689C10.1159 12.4821 10.166 12.2725 10.166 12.04C10.166 11.7666 10.1182 11.5296 10.0225 11.3291C9.93132 11.1286 9.78548 10.9736 9.58496 10.8643C9.389 10.7549 9.12695 10.7002 8.79883 10.7002H6.80273L6.81641 9.20996H9.25684L9.77637 9.79785C10.4098 9.78418 10.9157 9.88672 11.2939 10.1055C11.6768 10.3197 11.9525 10.6022 12.1211 10.9531C12.2897 11.304 12.374 11.6755 12.374 12.0674C12.374 12.7145 12.235 13.2568 11.957 13.6943C11.679 14.1273 11.2666 14.4531 10.7197 14.6719C10.1774 14.8906 9.50749 15 8.70996 15ZM17.1934 15.1367C16.6055 15.1367 16.0791 15.0433 15.6143 14.8564C15.1494 14.6696 14.7552 14.4121 14.4316 14.084C14.1126 13.7513 13.8688 13.3685 13.7002 12.9355C13.5316 12.5026 13.4473 12.04 13.4473 11.5479V11.2881C13.4473 10.7367 13.5247 10.2285 13.6797 9.76367C13.8346 9.29883 14.0602 8.89551 14.3564 8.55371C14.6572 8.20736 15.0264 7.94076 15.4639 7.75391C15.9014 7.5625 16.4004 7.4668 16.9609 7.4668C17.485 7.4668 17.9521 7.55339 18.3623 7.72656C18.7725 7.89518 19.1188 8.139 19.4014 8.45801C19.6839 8.77246 19.8981 9.15299 20.0439 9.59961C20.1943 10.0417 20.2695 10.5384 20.2695 11.0898V11.9648H14.3086V10.5908H18.1777V10.4268C18.1777 10.167 18.1299 9.93913 18.0342 9.74316C17.943 9.5472 17.8063 9.39681 17.624 9.29199C17.4463 9.18262 17.2207 9.12793 16.9473 9.12793C16.6875 9.12793 16.471 9.18262 16.2979 9.29199C16.1247 9.40137 15.9857 9.55632 15.8809 9.75684C15.7806 9.9528 15.7077 10.1829 15.6621 10.4473C15.6165 10.707 15.5938 10.9873 15.5938 11.2881V11.5479C15.5938 11.835 15.6325 12.097 15.71 12.334C15.7874 12.571 15.9014 12.7738 16.0518 12.9424C16.2021 13.111 16.3844 13.2432 16.5986 13.3389C16.8128 13.4346 17.0566 13.4824 17.3301 13.4824C17.6673 13.4824 17.9886 13.4186 18.2939 13.291C18.5993 13.1589 18.8636 12.9538 19.0869 12.6758L20.085 13.8174C19.9346 14.0361 19.7227 14.248 19.4492 14.4531C19.1803 14.6536 18.8568 14.8177 18.4785 14.9453C18.1003 15.0729 17.6719 15.1367 17.1934 15.1367ZM25.0684 7.60352V9.10059H20.6797V7.60352H25.0684ZM21.6846 5.77148H23.8242V12.6826C23.8242 12.8877 23.8493 13.0449 23.8994 13.1543C23.9495 13.2637 24.0316 13.3411 24.1455 13.3867C24.2594 13.4277 24.4053 13.4482 24.583 13.4482C24.7106 13.4482 24.82 13.4437 24.9111 13.4346C25.0023 13.4255 25.0866 13.4141 25.1641 13.4004V14.9453C24.9818 15.0046 24.7881 15.0501 24.583 15.082C24.3779 15.1185 24.1546 15.1367 23.9131 15.1367C23.4528 15.1367 23.054 15.0615 22.7168 14.9111C22.3841 14.7607 22.1289 14.5238 21.9512 14.2002C21.7734 13.8721 21.6846 13.446 21.6846 12.9219V5.77148ZM30.0107 13.2363V10.0645C30.0107 9.84115 29.9766 9.64974 29.9082 9.49023C29.8398 9.33073 29.7327 9.2054 29.5869 9.11426C29.4411 9.02311 29.252 8.97754 29.0195 8.97754C28.8236 8.97754 28.6527 9.01172 28.5068 9.08008C28.3656 9.14844 28.2562 9.24642 28.1787 9.37402C28.1058 9.50163 28.0693 9.65885 28.0693 9.8457H25.9365C25.9365 9.51302 26.0117 9.20312 26.1621 8.91602C26.3125 8.62891 26.5267 8.37598 26.8047 8.15723C27.0872 7.93848 27.4245 7.76986 27.8164 7.65137C28.2083 7.52832 28.6481 7.4668 29.1357 7.4668C29.7145 7.4668 30.2295 7.56478 30.6807 7.76074C31.1364 7.95215 31.4964 8.24154 31.7607 8.62891C32.0251 9.01172 32.1572 9.49479 32.1572 10.0781V13.1748C32.1572 13.6214 32.1823 13.9723 32.2324 14.2275C32.2871 14.4782 32.3646 14.6969 32.4648 14.8838V15H30.3115C30.2113 14.7858 30.1361 14.5215 30.0859 14.207C30.0358 13.888 30.0107 13.5645 30.0107 13.2363ZM30.2773 10.4883L30.291 11.6641H29.2314C28.9945 11.6641 28.7894 11.6937 28.6162 11.7529C28.4476 11.8122 28.3109 11.8942 28.2061 11.999C28.1012 12.0993 28.0238 12.2178 27.9736 12.3545C27.9281 12.4867 27.9053 12.6325 27.9053 12.792C27.9053 12.9424 27.9417 13.0791 28.0146 13.2021C28.0876 13.3206 28.1878 13.4141 28.3154 13.4824C28.443 13.5508 28.5911 13.585 28.7598 13.585C29.0378 13.585 29.2747 13.5303 29.4707 13.4209C29.6712 13.3115 29.8262 13.1794 29.9355 13.0244C30.0449 12.8649 30.0996 12.7168 30.0996 12.5801L30.6123 13.4688C30.5303 13.651 30.43 13.8402 30.3115 14.0361C30.193 14.2275 30.0426 14.4076 29.8604 14.5762C29.6781 14.7402 29.457 14.8747 29.1973 14.9795C28.9421 15.0843 28.6344 15.1367 28.2744 15.1367C27.8096 15.1367 27.388 15.0433 27.0098 14.8564C26.6315 14.665 26.3285 14.403 26.1006 14.0703C25.8773 13.7376 25.7656 13.3548 25.7656 12.9219C25.7656 12.5345 25.8363 12.1904 25.9775 11.8896C26.1188 11.5889 26.3307 11.3337 26.6133 11.124C26.9004 10.9144 27.2604 10.7572 27.6934 10.6523C28.1263 10.543 28.6322 10.4883 29.2109 10.4883H30.2773Z"
                fill="white"
              />
            </svg>
          </Group>
          <Text className="mt-1">클립생성 할 땐? 클리피!</Text>
        </h1>

        <Text className={classes.description} color="dimmed">
          끊김 없이 클립을 생성하고, 소중한 순간을 간직하세요
        </Text>

        <Group position="center" className={classes.controls}>
          <Button
            onClick={goLogin}
            size="xl"
            className={classes.control}
            variant="gradient"
            gradient={{ from: "violet", to: "grape" }}
            leftIcon={<BrandTwitch size={20} />}
          >
            트위치로 로그인하기
          </Button>
        </Group>
      </Container>
      <FooterMain />
    </Flex>
  );
}
